Revit 2027 API
ParameterTypeId.StructuralBeamEndAttachmentType Property
 "End Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEndAttachmentType { get; }
Public Shared ReadOnly Property StructuralBeamEndAttachmentType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEndAttachmentType {
	ForgeTypeId^ get ();
}
static member StructuralBeamEndAttachmentType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace